=====
Function no args
=====
[function1()]
---

    (statement
      (expression
        (function
          (functionName))))

=====
Simple expression
=====
[myFunction('argString')]
---

    (statement
      (expression
        (function
          (functionName)
          (arguments
            (string)))))

=====
Multiple arguments
=====
[myFunction('argString', 1, -1, true)]
---

    (statement
      (expression
        (function
          (functionName)
          (arguments
            (string)
            (number)
            (number)
            (boolean)))))

=====
Nested functions
=====
[function1('argString', function2(1, functionThree('threeString', 3), 2), 'oneString')]
---

    (statement
      (expression
        (function
          (functionName)
          (arguments
            (string)
            (expression
              (function
                (functionName)
                (arguments
                  (number)
                  (expression
                    (function
                      (functionName)
                      (arguments
                        (string)
                        (number))))
                  (number))))
            (string)))))

=====
Function with dot-notation
=====
[functionOne('argString').prop1.prop2]
---

    (statement
      (expression
        (function
          (functionName)
          (arguments
            (string)))
        (memberAccess
          (memberName)
          (memberName))))

=====
Nested dot-notation
=====
[functionOne(functionTwo(2).prop1.prop2).prop3]
---

    (statement
      (expression
        (function
          (functionName)
          (arguments
            (expression
              (function
                (functionName)
                (arguments
                  (number)))
              (memberAccess
                (memberName)
                (memberName)))))
        (memberAccess
          (memberName))))

=====
Quotes float input
=====
[myFunction('1234.5678')]
---

    (statement
      (expression
        (function
          (functionName)
          (arguments
              (string)))))

=====
Array index
=====
[myFunction('argString')[0]]
---

    (statement
      (expression
        (memberAccess
          (function
            (functionName)
            (arguments
              (string)))
          (index))))

=====
Multiple array indexes
=====
[myFunction('argString')[0][1][2]]
---

    (statement
      (expression
        (memberAccess
          (memberAccess
            (memberAccess
              (function
                (functionName)
                (arguments
                  (string)))
              (index))
            (index))
          (index))))

=====
Array index with function
=====
[myFunction('argString')[myFunction2(1)]]
---

    (statement
      (expression
        (memberAccess
          (function
            (functionName)
            (arguments
              (string)))
          (function
            (functionName)
            (arguments
              (number))))))

=====
Array index with function and dot-notation
=====
[myFunction('argString')[myFunction2(1)].prop1]
---

    (statement
      (expression
        (memberAccess
          (memberAccess
            (function
              (functionName)
              (arguments
                (string)))
            (function
              (functionName)
              (arguments
                (number))))
          (memberName)))

=====
Array index with function and nested dot-notation
=====
[myFunction('argString')[myFunction2(1).prop1.prop2].prop3]
---

    (statement
      (expression
        (memberAccess
          (memberAccess
            (function
              (functionName)
              (arguments
                (string)))
            (memberAccess
              (function
                (functionName)
                (arguments
                  (number)))
              (memberName)
              (memberName))
            (memberName))))

=====
Array index with function and nested dot-notation with index
=====
[myFunction('argString')[myFunction2(1).prop1.prop2][0]]
---

    (statement
      (expression
        (memberAccess
          (memberAccess
            (function
              (functionName)
              (arguments
                (string)))
            (memberAccess
              (function
                (functionName)
                (arguments
                  (number)))
              (memberName)
              (memberName))
            (index))))
